import { BotContext } from '../utils/types.js';
import { sendResponse } from '../utils/response.js';

const kaomojis = [
    "(●'◡'●)", "(◕‿◕✿)", "(｡♥‿♥｡)", "（〃・ω・〃）", "(*^ω^*)", 
    "（ꉺ▿ꉺ）", "(´｡• ᵕ •｡`) ♡", "╰(*´︶`*)╯", "(〃＾▽＾〃)", "o(>ω<)o",
    "\(^ヮ^)/", "(*≧ω≦*)", "(o˘◡˘o)", "(´ε｀ )♡", "(⌒‿⌒)",
    "Σ(°ロ°) ", "(・`ω´・)", "(=^･ω･^=)", "( ^..^)ﾉ", "٩(◕‿◕)۶",
    "(╯✧▽✧)╯", "(*°▽°*)", "°˖✧◝(⁰▿⁰)◜✧˖°", "(*^‿^*)", "(´･ᴗ･ ` )",
    "(っ˘ω˘ς )", "( ´◡‿ゝ◡`)", "(o´▽`o)", "ヽ(>∀<☆)ノ", "＼(￣▽￣)／",
    "(*^▽^*)", "(^人^)", "(o^▽^o)", "(≧◡≦)", "( ´ ▽ ` )",
    "｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡", "(b ᵔ▽ᵔ)b", "(๑˃ᴗ˂)̵", "(´ω｀*)", "o(〃＾▽＾〃)o",
    "( ˙꒳​˙ )", "(✯◡✯)", "(*^‿^*)", "(っ˘▽˘)っ", "( ´ ∀ ` )ﾉ",
    "(´▽`ʃƪ)♡", "♡( ◡‿◡ )", "(◕‿◕)♡", "(♡°▽°♡)", "( ˘⌣˘)♡",
    "(/▽＼*)｡o○♡", "Σ(￣。￣ﾉ)ﾉ", "(⊙_⊙)", "(O_O;)", "(o_O) !",
    "＼(º □ º l|l)/", "∑(O_O;)", " (￢_￢)", "( ￣ー￣)", "(¬_¬ )",
    "(￣ω￣;)", "(;¬_¬)", "(ーー;)", "(¬‿¬)", "(￣▽￣)ノ",
    "ヽ(ˇ∀ˇ)人(ˇ∀ˇ)ﾉ", "(*^ω^)八(⌒▽⌒)八(-‿- )", "｡*:☆(・ω・人・ω・)｡:゜☆｡",
    "ヽ( ⌒o⌒)人(⌒-⌒ )ﾉ", "ヾ(￣ー￣(≧ω≦*)ゝ", "(°∀°)b", "٩(ˊ〇ˋ*)و",
    "ଘ(੭ˊ꒳​ˋ)੭✧", "(๑•̀ㅂ•́)و", "(*•̀ᴗ•́*)و ̑̑", "(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧"
];

export async function kawaii(context: BotContext) {
    const randomKaomoji = kaomojis[Math.floor(Math.random() * kaomojis.length)];
    await sendResponse(context, randomKaomoji);
}
